InformationRegisters/СостояниеРабочихЦентровРеализацийТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРабочихЦентровРеализацийТоваровУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтрокЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модуль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МодулиИПодсистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаВынос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйНомерСтола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПодачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостфиксСтола</Name>
					<Comment>Постфикс места заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стол</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуемаяДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуемаяДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуемаяДатаРазделенияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Уникальный идентификатор обработки обслуживания.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаИспользования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПравилаИспользования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравилИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМеню</v8:Type>
						<v8:Type>cfg:CatalogRef.Столы</v8:Type>
						<v8:Type>cfg:CatalogRef.Меню</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.РежимыРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСтрокЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыСтрокЗаказов</Name>
			<Comment>Определяет тип строки в документе заказ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
					<Comment>Товарная позиция заказа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Модификатор</Name>
					<Comment>Модификатор (ингредиент) блюда</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
					<Comment>Условие приготовления блюда</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комплект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РабочиеЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>РабочиеЦентры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Рестораны</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Принтер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостояниеРабочихЦентровРеализацийТоваровУслуг/Ext/ManagerModule.bsl
Процедура ПередЗаписьюДокумента(Документ, Отказ, РежимЗаписи) Экспорт
	
	Если Не Отказ Тогда
		Если ПолныйРежим() Тогда
			
			ДокументОбъект = Документ; ДокументОригинал = __ОбщегоНазначенияСервер.Оригинал(Документ);
			
			//Костенюк Александр-Старт 11.10.2013
			РасчетВстречки(ДокументОбъект, ДокументОригинал);
			Возврат;
			//Костенюк Александр-Финиш 11.10.2013
			
			МетаданныеДокумента = __ОбщегоНазначенияСервер.Метаданные(Документ);
			
			ДокументОбъект.РабочиеЦентры().Очистить();
			
			ТабличныеЧасти = Новый Массив; 
			ТабличныеЧасти.Добавить("Товары"); 
			//ТабличныеЧасти.Добавить("Услуги"); //Костенюк Александр-Закомментировано 22.04.2013
			
			ТаблицаПозиций = ДокументОбъект.Товары.Выгрузить().СкопироватьКолонки("НоменклатурнаяГруппа,Номенклатура,Количество");
			ТаблицаПозиций.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
			ТаблицаПозиций.Колонки.Добавить("Владелец", Новый ОписаниеТипов("Строка"));       			
			ТаблицаПозиций.Колонки.Добавить("Возврат", Новый ОписаниеТипов("Булево"));
			
			ДокуметыПроверки = Новый Массив; // Именно в таком порядке добаления.
			ДокуметыПроверки.Добавить(Новый Структура("ДокументИсходный,ДокументПроверки", ДокументОбъект, ДокументОригинал));
			
			ДокуметыПроверки.Добавить(Новый Структура("ДокументИсходный,ДокументПроверки", ДокументОригинал, ДокументОбъект));
			ДокументОбъект.ДополнительныеСвойства.Вставить("ПовторВстречки",Ложь);
			
			Возвратная = Ложь; 
			
			СтрокаGUID = "00000000-0000-0000-0000-000000000000"; 
			ПустойУИдентификатор = Новый УникальныйИдентификатор(СтрокаGUID);
			
			Для Каждого Докуметы Из ДокуметыПроверки Цикл
				
				ДокументИсходный = Докуметы.ДокументИсходный; 
				ДокументПроверки = Докуметы.ДокументПроверки;
				
				Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
					
					Для Каждого СтрокаТабличнойЧасти Из ДокументИсходный[ТабличнаяЧасть] Цикл
						
						//Если СтрокаТабличнойЧасти.Владелец=ПустойУИдентификатор тогда
						//Если //НЕ СтрокаТабличнойЧасти.Распечатан ИЛИ 
						//	//СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Условие  ИЛИ
						//		СтрокаТабличнойЧасти.Количество=0 Тогда // ИЛИ
						//		//СтрокаТабличнойЧасти.ВидНоменклатуры<>Перечисления.ТипыСтрокЗаказов.Товар Тогда
						//		Продолжить;
						//	КонецЕсли;
							
						Если Не СтрокаТабличнойЧасти.Распечатан Тогда
							Продолжить;
						КонецЕсли;
							
							СтрокаСравниваемойТабличнойЧасти = ДокументПроверки[ТабличнаяЧасть].Найти(СтрокаТабличнойЧасти.Идентификатор, "Идентификатор");
							
							Если СтрокаСравниваемойТабличнойЧасти=Неопределено
								ИЛИ НЕ СтрокаСравниваемойТабличнойЧасти.Распечатан Тогда
								Количество = СтрокаТабличнойЧасти.Количество;
							ИначеЕсли СтрокаТабличнойЧасти.Номенклатура.Весовой Тогда
								Продолжить;
							ИначеЕсли СтрокаСравниваемойТабличнойЧасти.Количество>=СтрокаТабличнойЧасти.Количество Тогда
								Продолжить;
							Иначе
								Количество = СтрокаТабличнойЧасти.Количество-СтрокаСравниваемойТабличнойЧасти.Количество;
							КонецЕсли;
							
						//КонецЕсли;
						
						СтрокаТаблицы = ТаблицаПозиций.Добавить();
						СтрокаТаблицы.Идентификатор = Строка(СтрокаТабличнойЧасти.Идентификатор);
						СтрокаТаблицы.Владелец = Строка(СтрокаТабличнойЧасти.Владелец);
						СтрокаТаблицы.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
						СтрокаТаблицы.НоменклатурнаяГруппа = СтрокаТабличнойЧасти.НоменклатурнаяГруппа;
						СтрокаТаблицы.Количество = Количество;
						СтрокаТаблицы.Возврат = Возвратная;
						
						// Притворимся владельцем - наепка друг Чекиста ;) 
						Если (СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Условие) Тогда
							УправлениеРеализациямиТоваровУслуг.ПритворитсяВладельцем(СтрокаТаблицы, ДокументИсходный[ТабличнаяЧасть], СтрокаТабличнойЧасти.Владелец);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				Возвратная = Истина; 
				
			КонецЦикла;
			
			// -- Распределение по рабочим центрам.
			Если Булево(ТаблицаПозиций.Количество()) Тогда
				
				// -- Установка выполненного статуса распечатанных, но не напечатанных (II).
				МассивРаспечатываемыхИдентификаторов = ТаблицаПозиций.ВыгрузитьКолонку("Идентификатор"); 
				
				// Александр Переверзев 19.03.2012 11:14:21 
				// ---- Выборка данных (I).
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ТаблицаПозиций.Идентификатор,
				|	ТаблицаПозиций.Владелец,
				|	ТаблицаПозиций.Номенклатура,
				|	ТаблицаПозиций.НоменклатурнаяГруппа,
				|	ТаблицаПозиций.Количество,
				|	ТаблицаПозиций.Возврат
				|ПОМЕСТИТЬ ТаблицаПозиций
				|ИЗ
				|	&ТаблицаПозиций КАК ТаблицаПозиций
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаПозицийДокумента.Номенклатура,
				|	ПОДСТРОКА(ТаблицаПозицийДокумента.Владелец, 1, 36) КАК Владелец,
				|	ПОДСТРОКА(ТаблицаПозицийДокумента.Идентификатор, 1, 36) КАК Идентификатор,
				|	ТаблицаПозицийДокумента.НоменклатурнаяГруппа,
				|	ТаблицаПозицийДокумента.Количество,
				|	ТаблицаПозицийДокумента.Возврат
				|ПОМЕСТИТЬ ТаблицаПозицийДокумента
				|ИЗ
				|	ТаблицаПозиций КАК ТаблицаПозицийДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаПозицийДокумента.Номенклатура,
				|	ПОДСТРОКА(ТаблицаПозицийДокумента.Владелец, 1, 36) КАК Владелец,
				|	ПОДСТРОКА(ТаблицаПозицийДокумента.Идентификатор, 1, 36) КАК Идентификатор
				|ПОМЕСТИТЬ ТаблицаГруппировки
				|ИЗ
				|	ТаблицаПозиций КАК ТаблицаПозицийДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПравилаИспользования.ОбъектИспользования,
				|	ПравилаИспользования.ВладелецПравилИспользования,
				|	ПравилаИспользования.Актуальность
				|ПОМЕСТИТЬ ПравилаИспользованияНоменклатуры
				|ИЗ
				|	РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
				|ГДЕ
				|	ПравилаИспользования.ОбъектИспользования ССЫЛКА Справочник.Номенклатура
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПравилаИспользования.ОбъектИспользования,
				|	ПравилаИспользования.ВладелецПравилИспользования,
				|	ПравилаИспользования.Актуальность
				|ПОМЕСТИТЬ ПравилаИспользованияНоменклатурнойГруппы
				|ИЗ
				|	РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
				|ГДЕ
				|	ПравилаИспользования.ОбъектИспользования ССЫЛКА Справочник.НоменклатурныеГруппы
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	РабочиеЦентры.Ссылка,
				|	РабочиеЦентры.ВерсияДанных,
				|	РабочиеЦентры.ПометкаУдаления,
				|	РабочиеЦентры.Предопределенный,
				|	РабочиеЦентры.Владелец,
				|	РабочиеЦентры.Родитель,
				|	РабочиеЦентры.Код,
				|	РабочиеЦентры.Наименование,
				|	РабочиеЦентры.Актуальность,
				|	РабочиеЦентры.Комментарий,
				|	РабочиеЦентры.Оборудование,
				|	РабочиеЦентры.Представление
				|ПОМЕСТИТЬ РабочиеЦентры
				|ИЗ
				|	Справочник.РабочиеЦентры КАК РабочиеЦентры
				|ГДЕ
				|	РабочиеЦентры.Актуальность
				|	И (НЕ РабочиеЦентры.Ссылка В
				|				(ВЫБРАТЬ
				|					ВложенныйЗапрос.ОбъектДоступа
				|				ИЗ
				|					(ВЫБРАТЬ
				|						НастройкиПравДоступаПользователей.ОбъектДоступа КАК ОбъектДоступа,
				|						МИНИМУМ(НастройкиПравДоступаПользователей.Актуальность) КАК Актуальность
				|					ИЗ
				|						РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
				|					ГДЕ
				|						НастройкиПравДоступаПользователей.ОбъектДоступа ССЫЛКА Справочник.РабочиеЦентры
				|						И (НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущаяГруппаПользователей
				|							ИЛИ НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущийПользователь
				|							ИЛИ НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущийРежимРаботы)
				|					СГРУППИРОВАТЬ ПО
				|										НастройкиПравДоступаПользователей.ОбъектДоступа
				|					) КАК ВложенныйЗапрос
				|				ГДЕ
				|					(НЕ ВложенныйЗапрос.Актуальность)))
				|	И РабочиеЦентры.Владелец = &Ресторан
				|	И &ПериодыДействия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РабочиеЦентры.Ссылка КАК РабочийЦентр,
				|	ТаблицаПозицийДокумента.Номенклатура,
				|	ТаблицаПозицийДокумента.Владелец,
				|	ТаблицаПозицийДокумента.Идентификатор,
				|	ТаблицаПозицийДокумента.НоменклатурнаяГруппа,
				|	ТаблицаПозицийДокумента.Количество,
				|	ТаблицаПозицийДокумента.Возврат
				|ПОМЕСТИТЬ ПозицииБезОтбора
				|ИЗ
				|	РабочиеЦентры КАК РабочиеЦентры,
				|	ТаблицаПозицийДокумента КАК ТаблицаПозицийДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТаблицаПозиций.РабочийЦентр,
				|	ТаблицаПозиций.Идентификатор,
				|	ТаблицаПозиций.Владелец,
				|	ТаблицаПозиций.Количество,
				|	ТаблицаПозиций.Возврат
				|ИЗ
				|	ПозицииБезОтбора КАК ТаблицаПозиций
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаИспользованияНоменклатурнойГруппы КАК ПравилаИспользованияНоменклатурнойГруппы
				|		ПО ТаблицаПозиций.НоменклатурнаяГруппа = ПравилаИспользованияНоменклатурнойГруппы.ОбъектИспользования
				|			И ТаблицаПозиций.РабочийЦентр = ПравилаИспользованияНоменклатурнойГруппы.ВладелецПравилИспользования
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаИспользованияНоменклатуры КАК ПравилаИспользованияНоменклатуры
				|		ПО ТаблицаПозиций.Номенклатура = ПравилаИспользованияНоменклатуры.ОбъектИспользования
				|			И ТаблицаПозиций.РабочийЦентр = ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования
				|ГДЕ
				|	(ПравилаИспользованияНоменклатурнойГруппы.Актуальность ЕСТЬ NULL 
				|			ИЛИ ПравилаИспользованияНоменклатурнойГруппы.Актуальность)
				|	И (ПравилаИспользованияНоменклатуры.Актуальность ЕСТЬ NULL 
				//|			ИЛИ ПравилаИспользованияНоменклатуры.Актуальность)");
				//Костенюк Александр-Старт 24.10.2012
				|			ИЛИ ПравилаИспользованияНоменклатуры.Актуальность)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТаблицаПозиций
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТаблицаПозицийДокумента
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ТаблицаГруппировки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ПравилаИспользованияНоменклатуры
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ПравилаИспользованияНоменклатурнойГруппы
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ РабочиеЦентры
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ ПозицииБезОтбора");
				//Костенюк Александр-Финиш 24.10.2012
				
				// Александр Переверзев 19.03.2012 11:15:30 
				РегистрыСведений.ПериодыДействия.ПериодДействияСгенерироватьУсловиеЗапроса(Запрос, "&ПериодыДействия", "РабочиеЦентры");
				
				Запрос.УстановитьПараметр("Ресторан", ДокументОбъект.Ресторан);
				Запрос.УстановитьПараметр("ТекущаяГруппаПользователей", ПараметрыСеанса.ТекущаяГруппаПользователей);
				Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
				Запрос.УстановитьПараметр("ТекущийРежимРаботы", ПараметрыСеанса.ТекущийРежимРаботы);
				Запрос.УстановитьПараметр("ТаблицаПозиций", ТаблицаПозиций);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				// Перенос данных.
				ТаблицаПозиций = РезультатЗапроса.Выгрузить();
				
				// Владельцы.
				Для Каждого СтрокаТаблицы Из ТаблицаПозиций Цикл
					Если (СтрокаТаблицы.Владелец = СтрокаGUID) Тогда
						Продолжить;
					КонецЕсли;
					
					// Позиция печатается без владельца - великая печалька :'(
					Если Не Булево(ТаблицаПозиций.НайтиСтроки(Новый Структура("Идентификатор,Возврат,РабочийЦентр", СтрокаТаблицы.Владелец, СтрокаТаблицы.Возврат, СтрокаТаблицы.РабочийЦентр)).Количество()) Тогда
						СтрокаВладелец = ТаблицаПозиций.Найти(СтрокаТаблицы.Владелец, "Идентификатор");
						Если (Не СтрокаВладелец = Неопределено) Тогда
							
							СтрокаКлон = ТаблицаПозиций.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаКлон, СтрокаВладелец);
							ЗаполнитьЗначенияСвойств(СтрокаКлон, СтрокаТаблицы, "РабочийЦентр,Возврат");
						
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
				Если Булево(ТаблицаПозиций.Количество()) Тогда
					
					Возвратная = Ложь; 
					
					Для Каждого Докуметы Из ДокуметыПроверки Цикл
						ДокументИсходный = Докуметы.ДокументИсходный;
						
						Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
							
							МассивСтрокТаблицыПозиций = Неопределено;
														
							Для Каждого СтрокаТабличнойЧасти Из ДокументИсходный[ТабличнаяЧасть] Цикл
								
								// FrontOffice 01.12.2011 17:58:58
								Если СтрокаТабличнойЧасти.Распечатан и СтрокаТабличнойЧасти.Номенклатура.Временной Тогда
									Продолжить;
								КонецЕсли;
								
								Если (СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Товар) Тогда
									МассивСтрокТаблицыПозиций = ТаблицаПозиций.НайтиСтроки(Новый Структура("Идентификатор,Возврат",Строка(СтрокаТабличнойЧасти.Идентификатор), Возвратная));
									КоличествоСтрокиТабличнойЧастиОтбора = СтрокаТабличнойЧасти.Количество;		
								Иначе 
									МассивСтрокТаблицыПозиций = ТаблицаПозиций.НайтиСтроки(Новый Структура("Идентификатор,Возврат",Строка(СтрокаТабличнойЧасти.Идентификатор), Возвратная));
								КонецЕсли;
								
								
								Если (МассивСтрокТаблицыПозиций = Неопределено) Тогда
									Продолжить;
								КонецЕсли;
								
								Для Каждого СтрокаТаблицыПозиций Из МассивСтрокТаблицыПозиций Цикл
									
									//Если (СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Условие) Тогда
									//	Продолжить;
									//КонецЕсли;
									
									Если (СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Товар) Тогда
										Количество = СтрокаТаблицыПозиций.Количество;
									ИначеЕсли  (СтрокаТабличнойЧасти.ВидНоменклатуры = Перечисления.ТипыСтрокЗаказов.Модификатор) Тогда
										Если (КоличествоСтрокиТабличнойЧастиОтбора = СтрокаТаблицыПозиций.Количество) Тогда
											Количество = СтрокаТаблицыПозиций.Количество;
										Иначе
											Количество = СтрокаТабличнойЧасти.Количество * (СтрокаТаблицыПозиций.Количество / КоличествоСтрокиТабличнойЧастиОтбора); // На ноль проверять не нужно, нулевые строки были отброшены еще при подготовке данных для запроса.
										КонецЕсли;
									КонецЕсли;
									
									ДокументОбъект.РабочиеЦентры().Добавить(ДокументИсходный, СтрокаТабличнойЧасти, СтрокаТаблицыПозиций.РабочийЦентр, СтрокаТабличнойЧасти.Идентификатор, Возвратная, Количество);
									
								КонецЦикла;
								
							КонецЦикла;
						КонецЦикла;
						
						Возвратная = Истина; 
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			// -- Установка выполненного статуса распечатанных, но не напечатанных (III).
			
			Если (Не МассивРаспечатываемыхИдентификаторов = Неопределено) Тогда
				МассивРаспечатанныхИдентификаторов = ТаблицаПозиций.ВыгрузитьКолонку("Идентификатор"); 
				
				Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
					Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект[ТабличнаяЧасть] Цикл
						
						СтрокаТабличнойЧасти.Выполненн = СтрокаТабличнойЧасти.Выполненн Или
						//квв
						((Не МассивРаспечатываемыхИдентификаторов.Найти(Строка(СтрокаТабличнойЧасти.Идентификатор)) = Неопределено) И (МассивРаспечатанныхИдентификаторов.Найти(Строка(СтрокаТабличнойЧасти.Идентификатор)) = Неопределено));
						
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюДокумента()

Процедура ПриЗаписиДокумента(Документ, Отказ) Экспорт
	
	Если Не Отказ Тогда
		Если ПолныйРежим() Тогда
			
			Документ.Печать("Встречка", ,,, Истина);			
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписиДокумента()

//Костенюк Александр-Старт 07.10.2013
//
// Процедура служит для расчета встречки
//
// Параметры:
// ДокументОбъект - Тип: ДокументОбъект.РеализацияТоваровУслуг
// ДокументСсылка - Тип: ДокументСсылка.РеализацияТоваровУслуг
// ДатаПечатиВстречки - Тип: Дата
//
Процедура РасчетВстречки(ДокументОбъект, ДокументСсылка, ДатаПечатиВстречки = Неопределено, ТаблицаПозицийРабочиеЦентрыНеНазначены = Неопределено) Экспорт
	
	ДокументОбъект.РабочиеЦентры().Очистить();
	
	ТоварыОбъект = ДокументОбъект.Товары.Выгрузить();
	ТоварыСсылка = ДокументСсылка.Товары.Выгрузить();
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	// -- Расчет таблицы товаров.
	Если ДатаПечатиВстречки = Неопределено Тогда
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПовторВстречки", Ложь);
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТоварыОбъект.НомерСтроки,
		               |	ТоварыОбъект.ВидНоменклатуры,
		               |	ТоварыОбъект.ВладелецСтрока,
		               |	ТоварыОбъект.ДатаНачалаПериода,
		               |	ТоварыОбъект.ДатаОкончанияПериода,
		               |	ТоварыОбъект.ЕдиницаИзмерения,
		               |	ТоварыОбъект.ИдентификаторСтрока,
		               |	ТоварыОбъект.Количество,
		               |	ТоварыОбъект.НаВынос,
		               |	ТоварыОбъект.Номенклатура,
		               |	ТоварыОбъект.НоменклатурнаяГруппа,
		               |	ТоварыОбъект.Организация,
		               |	ТоварыОбъект.ПорядокПодачи,
		               |	ТоварыОбъект.Распечатан,
		               |	ТоварыОбъект.Комментарий
		               |ПОМЕСТИТЬ ТоварыОбъект
		               |ИЗ
		               |	&ТоварыОбъект КАК ТоварыОбъект
		               |ГДЕ
		               |	ТоварыОбъект.Распечатан
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварыСсылка.НомерСтроки,
		               |	ТоварыСсылка.ВидНоменклатуры,
		               |	ТоварыСсылка.ВладелецСтрока,
		               |	ТоварыСсылка.ДатаНачалаПериода,
		               |	ТоварыСсылка.ДатаОкончанияПериода,
		               |	ТоварыСсылка.ЕдиницаИзмерения,
		               |	ТоварыСсылка.ИдентификаторСтрока,
		               |	ТоварыСсылка.Количество,
		               |	ТоварыСсылка.НаВынос,
		               |	ТоварыСсылка.Номенклатура,
		               |	ТоварыСсылка.НоменклатурнаяГруппа,
		               |	ТоварыСсылка.Организация,
		               |	ТоварыСсылка.ПорядокПодачи,
		               |	ТоварыСсылка.Распечатан,
		               |	ТоварыСсылка.Комментарий
		               |ПОМЕСТИТЬ ТоварыСсылка
		               |ИЗ
		               |	&ТоварыСсылка КАК ТоварыСсылка
		               |ГДЕ
		               |	ТоварыСсылка.Распечатан
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварыОбъект.НомерСтроки,
		               |	ТоварыОбъект.ВидНоменклатуры,
		               |	ТоварыОбъект.ВладелецСтрока КАК Владелец,
		               |	ТоварыОбъект.ДатаНачалаПериода,
		               |	ТоварыОбъект.ДатаОкончанияПериода,
		               |	ТоварыОбъект.ЕдиницаИзмерения,
		               |	ТоварыОбъект.ИдентификаторСтрока КАК Идентификатор,
		               |	ТоварыОбъект.Количество - ЕСТЬNULL(ТоварыСсылка.Количество, 0) КАК Количество,
		               |	ТоварыОбъект.НаВынос,
		               |	ТоварыОбъект.Номенклатура,
		               |	ТоварыОбъект.НоменклатурнаяГруппа,
		               |	ТоварыОбъект.Организация,
		               |	ТоварыОбъект.ПорядокПодачи,
		               |	ТоварыОбъект.Распечатан,
		               |	ТоварыОбъект.Комментарий,
		               |	ЛОЖЬ КАК Возврат
		               |ПОМЕСТИТЬ ВТТаблицаПозиций
		               |ИЗ
		               |	ТоварыОбъект КАК ТоварыОбъект
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыСсылка КАК ТоварыСсылка
		               |		ПО ТоварыОбъект.ИдентификаторСтрока = ТоварыСсылка.ИдентификаторСтрока
		               |ГДЕ
		               |	(ТоварыСсылка.ИдентификаторСтрока ЕСТЬ NULL 
		               |			ИЛИ ТоварыОбъект.Количество - ТоварыСсылка.Количество > 0)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТоварыСсылка.НомерСтроки,
		               |	ТоварыСсылка.ВидНоменклатуры,
		               |	ТоварыСсылка.ВладелецСтрока,
		               |	ТоварыСсылка.ДатаНачалаПериода,
		               |	ТоварыСсылка.ДатаОкончанияПериода,
		               |	ТоварыСсылка.ЕдиницаИзмерения,
		               |	ТоварыСсылка.ИдентификаторСтрока,
		               |	ТоварыСсылка.Количество - ЕСТЬNULL(ТоварыОбъект.Количество, 0),
		               |	ТоварыСсылка.НаВынос,
		               |	ТоварыСсылка.Номенклатура,
		               |	ТоварыСсылка.НоменклатурнаяГруппа,
		               |	ТоварыСсылка.Организация,
		               |	ТоварыСсылка.ПорядокПодачи,
		               |	ТоварыСсылка.Распечатан,
		               |	ТоварыСсылка.Комментарий,
		               |	ИСТИНА
		               |ИЗ
		               |	ТоварыОбъект КАК ТоварыОбъект
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыСсылка КАК ТоварыСсылка
		               |		ПО ТоварыОбъект.ИдентификаторСтрока = ТоварыСсылка.ИдентификаторСтрока
		               |ГДЕ
		               |	(ТоварыОбъект.ИдентификаторСтрока ЕСТЬ NULL 
		               |			ИЛИ ТоварыСсылка.Количество - ТоварыОбъект.Количество > 0)";

		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ТоварыОбъект", ТоварыОбъект);
		Запрос.УстановитьПараметр("ТоварыСсылка", ТоварыСсылка);
		Запрос.Выполнить();
		
	Иначе
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ПовторВстречки", Истина);
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТоварыСсылка.НомерСтроки,
		               |	ТоварыСсылка.ВидНоменклатуры,
		               |	ТоварыСсылка.ВладелецСтрока КАК Владелец,
		               |	ТоварыСсылка.ДатаНачалаПериода,
		               |	ТоварыСсылка.ДатаОкончанияПериода,
		               |	ТоварыСсылка.ЕдиницаИзмерения,
		               |	ТоварыСсылка.ИдентификаторСтрока КАК Идентификатор,
		               |	ТоварыСсылка.Количество,
		               |	ТоварыСсылка.НаВынос,
		               |	ТоварыСсылка.Номенклатура,
		               |	ТоварыСсылка.НоменклатурнаяГруппа,
		               |	ТоварыСсылка.Организация,
		               |	ТоварыСсылка.ПорядокПодачи,
		               |	ТоварыСсылка.Распечатан,
		               |	ТоварыСсылка.Комментарий,
		               |	ЛОЖЬ КАК Возврат
		               |ПОМЕСТИТЬ ТоварыСсылка
		               |ИЗ
		               |	&ТоварыСсылка КАК ТоварыСсылка
		               |ГДЕ
		               |	ТоварыСсылка.Распечатан
		               |	И ТоварыСсылка.ДатаНачалаПериода = &ДатаПечатиВстречки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТоварыСсылка.НомерСтроки,
		               |	ТоварыСсылка.ВидНоменклатуры,
		               |	ТоварыСсылка.Владелец,
		               |	ТоварыСсылка.ДатаНачалаПериода,
		               |	ТоварыСсылка.ДатаОкончанияПериода,
		               |	ТоварыСсылка.ЕдиницаИзмерения,
		               |	ТоварыСсылка.Идентификатор,
		               |	ТоварыСсылка.Количество,
		               |	ТоварыСсылка.НаВынос,
		               |	ТоварыСсылка.Номенклатура,
		               |	ТоварыСсылка.НоменклатурнаяГруппа,
		               |	ТоварыСсылка.Организация,
		               |	ТоварыСсылка.ПорядокПодачи,
		               |	ТоварыСсылка.Распечатан,
		               |	ТоварыСсылка.Комментарий,
		               |	ТоварыСсылка.Возврат
		               |ПОМЕСТИТЬ ВТТаблицаПозиций
		               |ИЗ
		               |	ТоварыСсылка КАК ТоварыСсылка";
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Если ДатаПечатиВстречки = Дата(1, 1, 1) Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТоварыСсылка.ДатаНачалаПериода = &ДатаПечатиВстречки", "ИСТИНА");
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ТоварыСсылка"		, ТоварыСсылка);
		Запрос.УстановитьПараметр("ДатаПечатиВстречки"	, ДатаПечатиВстречки);
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// -- Распределение по рабочим центрам.
	ТекстЗапроса = "";
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаПозиций.НомерСтроки,
	               |	ТаблицаПозиций.ВидНоменклатуры,
	               |	ТаблицаПозиций.Владелец,
	               |	ТаблицаПозиций.ДатаНачалаПериода,
	               |	ТаблицаПозиций.ДатаОкончанияПериода,
	               |	ТаблицаПозиций.ЕдиницаИзмерения,
	               |	ТаблицаПозиций.Идентификатор,
	               |	ТаблицаПозиций.Количество,
	               |	ТаблицаПозиций.НаВынос,
	               |	ТаблицаПозиций.Номенклатура,
	               |	ТаблицаПозиций.НоменклатурнаяГруппа,
	               |	ТаблицаПозиций.Организация,
	               |	ТаблицаПозиций.ПорядокПодачи,
	               |	ТаблицаПозиций.Распечатан,
	               |	ТаблицаПозиций.Комментарий,
	               |	ТаблицаПозиций.Возврат
	               |ПОМЕСТИТЬ ТаблицаПозиций
	               |ИЗ
	               |	ВТТаблицаПозиций КАК ТаблицаПозиций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПравилаИспользования.ОбъектИспользования,
	               |	ПравилаИспользования.ВладелецПравилИспользования,
	               |	ПравилаИспользования.Актуальность
	               |ПОМЕСТИТЬ ПравилаИспользованияНоменклатуры
	               |ИЗ
	               |	РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
	               |ГДЕ
	               |	ПравилаИспользования.ОбъектИспользования ССЫЛКА Справочник.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПравилаИспользования.ОбъектИспользования,
	               |	ПравилаИспользования.ВладелецПравилИспользования,
	               |	ПравилаИспользования.Актуальность
	               |ПОМЕСТИТЬ ПравилаИспользованияНоменклатурнойГруппы
	               |ИЗ
	               |	РегистрСведений.ПравилаИспользования КАК ПравилаИспользования
	               |ГДЕ
	               |	ПравилаИспользования.ОбъектИспользования ССЫЛКА Справочник.НоменклатурныеГруппы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РабочиеЦентры.Ссылка
	               |ПОМЕСТИТЬ РабочиеЦентры
	               |ИЗ
	               |	Справочник.РабочиеЦентры КАК РабочиеЦентры
	               |ГДЕ
	               |	РабочиеЦентры.Актуальность
	               |	И НЕ РабочиеЦентры.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВложенныйЗапрос.ОбъектДоступа
	               |				ИЗ
	               |					(ВЫБРАТЬ
	               |						НастройкиПравДоступаПользователей.ОбъектДоступа КАК ОбъектДоступа,
	               |						МИНИМУМ(НастройкиПравДоступаПользователей.Актуальность) КАК Актуальность
	               |					ИЗ
	               |						РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	               |					ГДЕ
	               |						НастройкиПравДоступаПользователей.ОбъектДоступа ССЫЛКА Справочник.РабочиеЦентры
	               |						И (НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущаяГруппаПользователей
	               |							ИЛИ НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущийПользователь
	               |							ИЛИ НастройкиПравДоступаПользователей.ВладелецПравДоступа = &ТекущийРежимРаботы)
	               |					СГРУППИРОВАТЬ ПО
	               |										НастройкиПравДоступаПользователей.ОбъектДоступа
	               |					) КАК ВложенныйЗапрос
	               |				ГДЕ
	               |					НЕ ВложенныйЗапрос.Актуальность)
	               |	И РабочиеЦентры.Владелец = &Ресторан
	               |	И &ПериодыДействия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РабочиеЦентры.Ссылка КАК РабочийЦентр,
	               |	ТаблицаПозиций.НомерСтроки,
	               |	ТаблицаПозиций.ВидНоменклатуры,
	               |	ТаблицаПозиций.Владелец,
	               |	ТаблицаПозиций.ДатаНачалаПериода,
	               |	ТаблицаПозиций.ДатаОкончанияПериода,
	               |	ТаблицаПозиций.ЕдиницаИзмерения,
	               |	ТаблицаПозиций.Идентификатор,
	               |	ТаблицаПозиций.Количество,
	               |	ТаблицаПозиций.НаВынос,
	               |	ТаблицаПозиций.Номенклатура,
	               |	ТаблицаПозиций.НоменклатурнаяГруппа,
	               |	ТаблицаПозиций.Организация,
	               |	ТаблицаПозиций.ПорядокПодачи,
	               |	ТаблицаПозиций.Распечатан,
	               |	ТаблицаПозиций.Комментарий,
	               |	ТаблицаПозиций.Возврат
	               |ПОМЕСТИТЬ ТаблицаПозицийБезОтбора
	               |ИЗ
	               |	РабочиеЦентры КАК РабочиеЦентры,
	               |	ТаблицаПозиций КАК ТаблицаПозиций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПозицийБезОтбора.РабочийЦентр,
	               |	ТаблицаПозицийБезОтбора.НомерСтроки,
	               |	ТаблицаПозицийБезОтбора.ВидНоменклатуры,
	               |	ТаблицаПозицийБезОтбора.Владелец,
	               |	ТаблицаПозицийБезОтбора.ДатаНачалаПериода,
	               |	ТаблицаПозицийБезОтбора.ДатаОкончанияПериода,
	               |	ТаблицаПозицийБезОтбора.ЕдиницаИзмерения,
	               |	ТаблицаПозицийБезОтбора.Идентификатор,
	               |	ТаблицаПозицийБезОтбора.Количество,
	               |	ТаблицаПозицийБезОтбора.НаВынос,
	               |	ТаблицаПозицийБезОтбора.Номенклатура,
	               |	ТаблицаПозицийБезОтбора.НоменклатурнаяГруппа,
	               |	ТаблицаПозицийБезОтбора.Организация,
	               |	ТаблицаПозицийБезОтбора.ПорядокПодачи,
	               |	ТаблицаПозицийБезОтбора.Распечатан,
	               |	ТаблицаПозицийБезОтбора.Комментарий,
	               |	ТаблицаПозицийБезОтбора.Возврат
	               |ПОМЕСТИТЬ ТаблицаПозицийРабочиеЦентры
	               |ИЗ
	               |	ТаблицаПозицийБезОтбора КАК ТаблицаПозицийБезОтбора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаИспользованияНоменклатурнойГруппы КАК ПравилаИспользованияНоменклатурнойГруппы
	               |		ПО ТаблицаПозицийБезОтбора.НоменклатурнаяГруппа = ПравилаИспользованияНоменклатурнойГруппы.ОбъектИспользования
	               |			И ТаблицаПозицийБезОтбора.РабочийЦентр = ПравилаИспользованияНоменклатурнойГруппы.ВладелецПравилИспользования
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПравилаИспользованияНоменклатуры КАК ПравилаИспользованияНоменклатуры
	               |		ПО ТаблицаПозицийБезОтбора.Номенклатура = ПравилаИспользованияНоменклатуры.ОбъектИспользования
	               |			И ТаблицаПозицийБезОтбора.РабочийЦентр = ПравилаИспользованияНоменклатуры.ВладелецПравилИспользования
	               |ГДЕ
	               |	(ПравилаИспользованияНоменклатурнойГруппы.Актуальность ЕСТЬ NULL 
	               |			ИЛИ ПравилаИспользованияНоменклатурнойГруппы.Актуальность)
	               |	И (ПравилаИспользованияНоменклатуры.Актуальность ЕСТЬ NULL 
	               |			ИЛИ ПравилаИспользованияНоменклатуры.Актуальность)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаПозиций.НомерСтроки,
	               |	ТаблицаПозиций.ВидНоменклатуры,
	               |	ТаблицаПозиций.Владелец,
	               |	ТаблицаПозиций.ДатаНачалаПериода,
	               |	ТаблицаПозиций.ДатаОкончанияПериода,
	               |	ТаблицаПозиций.ЕдиницаИзмерения,
	               |	ТаблицаПозиций.Идентификатор,
	               |	ТаблицаПозиций.Количество,
	               |	ТаблицаПозиций.НаВынос,
	               |	ТаблицаПозиций.Номенклатура,
	               |	ТаблицаПозиций.НоменклатурнаяГруппа,
	               |	ТаблицаПозиций.Организация,
	               |	ТаблицаПозиций.ПорядокПодачи,
	               |	ТаблицаПозиций.Распечатан,
	               |	ТаблицаПозиций.Комментарий,
	               |	ТаблицаПозиций.Возврат,
	               |	ТаблицаПозиций.Номенклатура КАК Наименование
	               |ПОМЕСТИТЬ ТаблицаПозицийРабочиеЦентрыНеНазначены
	               |ИЗ
	               |	ТаблицаПозиций КАК ТаблицаПозиций
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаПозицийРабочиеЦентры КАК ТаблицаПозицийРабочиеЦентры
	               |		ПО ТаблицаПозиций.Идентификатор = ТаблицаПозицийРабочиеЦентры.Идентификатор
	               |ГДЕ
	               |	ТаблицаПозицийРабочиеЦентры.Идентификатор ЕСТЬ NULL ";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	РегистрыСведений.ПериодыДействия.ПериодДействияСгенерироватьУсловиеЗапроса(Запрос, "&ПериодыДействия", "РабочиеЦентры");
	Запрос.УстановитьПараметр("Ресторан"					, ДокументОбъект.Ресторан);
	Запрос.УстановитьПараметр("ТекущийРежимРаботы"			, ПараметрыСеанса.ТекущийРежимРаботы);
	Запрос.УстановитьПараметр("ТекущаяГруппаПользователей"	, ПараметрыСеанса.ТекущаяГруппаПользователей);
	Запрос.УстановитьПараметр("ТекущийПользователь"			, ПараметрыСеанса.ТекущийПользователь);
	Запрос.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ТаблицаПозицийРабочиеЦентры";
	ТаблицаПозиций = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ * ИЗ ТаблицаПозицийРабочиеЦентрыНеНазначены";
	ТаблицаПозицийРабочиеЦентрыНеНазначены = Запрос.Выполнить().Выгрузить();
	
	// Уничтожение временных таблиц
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ТекстЗапроса = "УНИЧТОЖИТЬ ВТТаблицаПозиций
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаПозицийРабочиеЦентры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТаблицаПозицийРабочиеЦентрыНеНазначены";
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	Если ТаблицаПозиций.Количество() Тогда
		Если ДатаПечатиВстречки = Неопределено Тогда
			ДокументОбъект.РабочиеЦентры().Загрузить(ТаблицаПозиций);
		Иначе
			// Повтор всех встречек
			Если ДатаПечатиВстречки = Дата(1, 1, 1) Тогда
				ТаблицаВстречек = ТаблицаПозиций.Скопировать();
				ТаблицаВстречек.Свернуть("ДатаНачалаПериода");
				Для Каждого СтрокаТаблицы Из ТаблицаВстречек Цикл
					ДатаНачалаПериода = СтрокаТаблицы.ДатаНачалаПериода;
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("ДатаНачалаПериода", ДатаНачалаПериода);
					ТаблицаВстречки = ТаблицаПозиций.Скопировать(ПараметрыОтбора);
					ДокументОбъект.РабочиеЦентры().Очистить();
					ДокументОбъект.РабочиеЦентры().Загрузить(ТаблицаВстречки);
					ДокументОбъект.Печать("Встречка",,,,Истина);	
				КонецЦикла;
			// Повтор конкретной встречки	
			Иначе
				ДокументОбъект.РабочиеЦентры().Загрузить(ТаблицаПозиций);
				ДокументОбъект.Печать("Встречка",,,,Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры
//Костенюк Александр-Финиш 07.10.2013
